Autodesk.Revit.DB.ImportIFCOptions.GetImportIFCOptions
Returns the current Revit instance's ImportIFCOptions.
Returns:
The ImportIFCOptions for the current Revit instance.
Since:
2024

Autodesk.Revit.DB.ImportIFCOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ImportIFCOptions.LinkProcessor
Specifies the engine to use while doing a Link IFC operation.
Remarks:
This setting allows the user to revert to the legacy Revit link IFC code
when linking in IFC files, to preserve old behavior.  There are three supported
options:
Default: let Revit decide the best processor.
Legacy: use only the legacy Revit Link IFC processor.
AnyCAD: use AnyCAD to help Link IFC files.
Any other value (or no entry) will behave as "Default".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.ImportIFCOptions
Provides access to settings that control linking and opening IFC files.
Remarks:
These settings are stored in the Revit.ini file.  All documents in Revit instances which use this Revit.ini will follow these settings.
Since:
2024